{
  "team": [
    {
      "name": "Jeff Kendal",
      "position": "Founder & CEO",
      "image": "../public/jeff.jpeg",
      "bio": "Jeff, a seasoned professional with over three decades of expertise in Information Technology, Product Management, and Operations, serves as the CEO and Founder of 296 Group. His impressive track record includes successfully steering both start-up ventures and large corporate businesses from their initial concepts to highly efficient operational states. Before establishing 296 Group, Jeff held pivotal roles such as COO/CTO at DGDean, where he contributed to the growth of multiple VC-backed portfolio companies. He also served as the Chief Information Officer at Affinion Group, a global provider of affinity products to major financial institutions and retailers. Jeff's career also includes being a founding member of Webloyalty, where he played a pivotal role in propelling the company from its inception to generating over $300 million in revenues. Jeff holds a Master's Degree in Financial Management from Fairfield University and a Bachelor's degree in Marketing Management from Bentley University."
    },
    {
      "name": "Bharat Gidwani",
      "position": "Chief Technology Officer",
      "image": "../public/bharat.jpeg",
      "bio": "Bharat Gidwani is the Chief Technology Officer of 296 Group Inc. Bharat has over 20 years of experience designing and delivering scalable applications with both start-up and multi-national organizations. Prior to 296 Group, Bharat worked as Director of Engineering in DGDean and as an Architect in Weight Watchers (WW), focusing on delivering consumer-facing web and mobile applications using cloud native solutions. He has implemented technical solutions using robust, cost effective and scalable APIs, using distributed onshore and offshore teams. Bharat has comprehensive experience in implementing PCI and regulatory standards, both for US and EU markets, ensuring secure storage and protection of sensitive information."
    },
    {
      "name": "Mike Yakubovich",
      "position": "Chief Architect",
      "image": "../public/noprofile.jpeg",
      "bio": "Mike is the current Chief Architect for 296 Group and brings 25+ years of experience in designing and implementing software solutions. In his previous role as Chief Architect for DGDean, Mike led the development of several large-scale startups from their inception. During his tenure at SingleCare.com (RxSense), a high transaction prescription discount card and pharmacy benefits management platform, Mike engineered a high performance system that processed hundreds of thousands of transactions daily with an average response time of less than 2 seconds and an SLA of 99.999%. Prior to that Mike was the Lead Architect for WeightWatchers International and was instrumental in re-architecting a companywide framework to support multiple countries on a single codebase."
    }
  ]
}
